#lang Racket

(define (my-concat l1 l2) (
    if (empty? l1)
    l2
    (cons (car l1) (my-concat (cdr l1) l2))
))

;;--- TESTCASES ---;;

(my-concat '(1 2 3 4) '(5 6 7))
; (1 2 3 4 5 6 7)
(my-concat '(1 2 3 4) '())
; (1 2 3 4)
(my-concat '() '(5 6 7))
; (5 6 7)

; ฟังก์ชัน my-concat ในการเรียกตัวเองทุกครั้ง สมาชิกใน list1 จะหายไปทีละ 1 ตัว จนกระทั่งกลายเป็น list ว่าง 
; ดังนั้นจะมีการเรียกตัวเองทั้งหมด n ครั้ง เนื่องจากว่าการทำงานของฟังก์ชั่น cons เป็นเหมือนกับการเอา list มาต่อกัน 
; (เหมือนกับ linked-list) จึงทำให้ความยาวของ list2 ไม่มีผลต่อเวลาการทำงาน เพราะเหมือนแค่เอาปลาย list1 มาต่อกับ list2 เฉยๆ
; Time Complexity: O(n)